FreeRTOS/FreeRTOS/Demo/CORTEX_LPC1766_GCC_RedSuite/RTOSDemo/LPC17xx_defs.h
#define PINSEL1_P031_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P031_UPLED    ((unsigned int) 0x40000000)
#define PINSEL1_P031_CONNECT  ((unsigned int) 0x80000000)
#define PINSEL1_P031_RSVD3    ((unsigned int) 0xc0000000)
#define PINSEL1_P031_MASK     ((unsigned int) 0xc0000000)

#define PINSEL2_P13626_GPIO   ((unsigned int) 0x00000000) 
#define PINSEL2_P13626_DEBUG  ((unsigned int) 0x00000004) 
#define PINSEL2_P13626_MASK   ((unsigned int) 0x00000004)

#define PINSEL2_P12516_GPIO   ((unsigned int) 0x00000000) 
#define PINSEL2_P12516_TRACE  ((unsigned int) 0x00000008) 
#define PINSEL2_P12516_MASK   ((unsigned int) 0x00000008)

/* General Purpose Input/Output (GPIO) */
/* Fast I/O setup */

#define FIO_BASE_ADDR		0x50014000

#define FIO0DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x00)) 
#define FIO0MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x10))
#define FIO0PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x14))
#define FIO0SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x18))
#define FIO0CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x1C))

#ifdef LPC1766_UM_DEFS
/* Fast GPIO Register Access */
#define FIO0SET0 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x38))
#define FIO0SET1 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x39))
#define FIO0SET2 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3A))
#define FIO0SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3B))
#define FIO0SETL 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x38))
#define FIO0SETU 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3A))
#endif

#define FIO1DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x20)) 
#define FIO1MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x30))
#define FIO1PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x34))
#define FIO1SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x38))
#define FIO1CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3C))

#ifdef LPC1766_UM_DEFS
/* Fast GPIO Register Access */
#define FIO1SET0 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x78))
#define FIO1SET1 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x79))
#define FIO1SET2 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7A))
#define FIO1SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7B))
#define FIO1SETL 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x78))
#define FIO1SETU 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7A))
#endif

#define FIO2DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x40)) 
#define FIO2MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x50))
#define FIO2PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x54))
#define FIO2SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x58))
#define FIO2CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x5C))

#ifdef LPC1766_UM_DEFS
/* Fast GPIO Register Access */
#define FIO2SET0 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xB8))
#define FIO2SET1 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xB9))
#define FIO2SET2 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xBA))
#define FIO2SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xBB))
#define FIO2SETL 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xB8))
#define FIO2SETU 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xBA))
#endif

#define FIO3DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x60)) 
#define FIO3MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x70))
#define FIO3PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x74))
#define FIO3SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x78))
#define FIO3CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x7C))

#ifdef LPC1766_UM_DEFS
/* Fast GPIO Register Access */
#define FIO3SET0 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xF8))
#define FIO3SET1 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xF9))
#define FIO3SET2 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xFA))
#define FIO3SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xFB))
#define FIO3SETL 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xF8))
#define FIO3SETU 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0xFA))
#endif

#define FIO4DIR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x80)) 
#define FIO4MASK       (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x90))
#define FIO4PIN        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x94))
#define FIO4SET        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x98))
#define FIO4CLR        (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x9C))

#ifdef LPC1766_UM_DEFS
/* Fast GPIO Register Access */
#define FIO4SET0 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x138))
#define FIO4SET1 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x139))
#define FIO4SET2 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x13A))
#define FIO0SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x3B))
#define FIO4SET3 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x13B))
#define FIO4SETL 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x138))
#define FIO4SETU 	   (*(volatile unsigned long *)(FIO_BASE_ADDR + 0x13A))
#endif

/* General Purpose Input/Output (GPIO) */
#define GPIO_BASE_ADDR		0x40028000
#define IOPIN0         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x00))
#define IOSET0         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x04))
#define IODIR0         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x08))
#define IOCLR0         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x0C))
#define IOPIN1         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x10))
#define IOSET1         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x14))
#define IODIR1         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x18))
#define IOCLR1         (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x1C))

#define GPIO_IO_P0      ((unsigned int) 0x00000001)
#define GPIO_IO_P1      ((unsigned int) 0x00000002)
#define GPIO_IO_P2      ((unsigned int) 0x00000004)
#define GPIO_IO_P3      ((unsigned int) 0x00000008)
#define GPIO_IO_P4      ((unsigned int) 0x00000010)
#define GPIO_IO_P5      ((unsigned int) 0x00000020)
#define GPIO_IO_P6      ((unsigned int) 0x00000040)
#define GPIO_IO_P7      ((unsigned int) 0x00000080)
#define GPIO_IO_P8      ((unsigned int) 0x00000100)
#define GPIO_IO_P9      ((unsigned int) 0x00000200)
#define GPIO_IO_P10     ((unsigned int) 0x00000400)
#define GPIO_IO_P11     ((unsigned int) 0x00000800)
#define GPIO_IO_P12     ((unsigned int) 0x00001000)
#define GPIO_IO_P13     ((unsigned int) 0x00002000)
#define GPIO_IO_P14     ((unsigned int) 0x00004000)
#define GPIO_IO_P15     ((unsigned int) 0x00008000)
#define GPIO_IO_P16     ((unsigned int) 0x00010000)
#define GPIO_IO_P17     ((unsigned int) 0x00020000)
#define GPIO_IO_P18     ((unsigned int) 0x00040000)
#define GPIO_IO_P19     ((unsigned int) 0x00080000)
#define GPIO_IO_P20     ((unsigned int) 0x00100000)
#define GPIO_IO_P21     ((unsigned int) 0x00200000)
#define GPIO_IO_P22     ((unsigned int) 0x00400000)
#define GPIO_IO_P23     ((unsigned int) 0x00800000)
#define GPIO_IO_P24     ((unsigned int) 0x01000000)
#define GPIO_IO_P25     ((unsigned int) 0x02000000)
#define GPIO_IO_P26     ((unsigned int) 0x04000000)
#define GPIO_IO_P27     ((unsigned int) 0x08000000)
#define GPIO_IO_P28     ((unsigned int) 0x10000000)
#define GPIO_IO_P29     ((unsigned int) 0x20000000)
#define GPIO_IO_P30     ((unsigned int) 0x40000000)
#define GPIO_IO_P31     ((unsigned int) 0x80000000)
#define GPIO_IO_JTAG    ((unsigned int) 0x003E0000)

/* GPIO Interrupt Registers */
#define IO0_INT_EN_R    (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x90)) 
#define IO0_INT_EN_F    (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x94))
#define IO0_INT_STAT_R  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x84))
#define IO0_INT_STAT_F  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x88))
#define IO0_INT_CLR     (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x8C))

#define IO2_INT_EN_R    (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xB0)) 
#define IO2_INT_EN_F    (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xB4))
#define IO2_INT_STAT_R  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xA4))
#define IO2_INT_STAT_F  (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xA8))
#define IO2_INT_CLR     (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0xAC))

