FreeRTOS/FreeRTOS/Demo/CORTEX_LPC1766_GCC_RedSuite/RTOSDemo/LPC17xx_defs.h
/* Timer 2 */
#define TMR2_BASE_ADDR		0x40090000
#define T2IR           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x00))
#define T2TCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x04))
#define T2TC           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x08))
#define T2PR           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x0C))
#define T2PC           (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x10))
#define T2MCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x14))
#define T2MR0          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x18))
#define T2MR1          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x1C))
#define T2MR2          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x20))
#define T2MR3          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x24))
#define T2CCR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x28))
#define T2CR0          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x2C))
#define T2CR1          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x30))
#define T2CR2          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x34))
#define T2CR3          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x38))
#define T2EMR          (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x3C))
#define T2CTCR         (*(volatile unsigned long *)(TMR2_BASE_ADDR + 0x70))

/* Timer 3 */
#define TMR3_BASE_ADDR		0x40094000
#define T3IR           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x00))
#define T3TCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x04))
#define T3TC           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x08))
#define T3PR           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x0C))
#define T3PC           (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x10))
#define T3MCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x14))
#define T3MR0          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x18))
#define T3MR1          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x1C))
#define T3MR2          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x20))
#define T3MR3          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x24))
#define T3CCR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x28))
#define T3CR0          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x2C))
#define T3CR1          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x30))
#define T3CR2          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x34))
#define T3CR3          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x38))
#define T3EMR          (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x3C))
#define T3CTCR         (*(volatile unsigned long *)(TMR3_BASE_ADDR + 0x70))

#define T_IR_MR0            0x00000001
#define T_IR_MR1            0x00000002
#define T_IR_MR2            0x00000004
#define T_IR_MR3            0x00000008
#define T_IR_CR0            0x00000010
#define T_IR_CR1            0x00000020
#define T_IR_CR2            0x00000040
#define T_IR_CR3            0x00000080
#define T_IR_MASK           0x000000FF

#define T_TCR_CE            0x00000001
#define T_TCR_CR            0x00000002

#define T_CTCR_MODE_PCLK    0x00000000
#define T_CTCR_MODE_CAPRISE 0x00000001
#define T_CTCR_MODE_CAPFALL 0x00000002
#define T_CTCR_MODE_CAPBOTH 0x00000003
#define T_CTCR_MODE_MASK    0x00000003
#define T_CTCR_CIS_CAPN0    0x00000000
#define T_CTCR_CIS_CAPN1    0x00000004
#define T_CTCR_CIS_CAPN2    0x00000008
#define T_CTCR_CIS_CAPN3    0x0000000C
#define T_CTCR_CIS_MASK     0x0000000C

#define T_MCR_MR0I          0x00000001
#define T_MCR_MR0R          0x00000002
#define T_MCR_MR0S          0x00000004
#define T_MCR_MR1I          0x00000008
#define T_MCR_MR1R          0x00000010
#define T_MCR_MR1S          0x00000020
#define T_MCR_MR2I          0x00000040
#define T_MCR_MR2R          0x00000080
#define T_MCR_MR2S          0x00000100
#define T_MCR_MR3I          0x00000200
#define T_MCR_MR3R          0x00000400
#define T_MCR_MR3S          0x00000800

#define T_CCR_CAP0RE        0x00000001
#define T_CCR_CAP0FE        0x00000002
#define T_CCR_CAP0I         0x00000004
#define T_CCR_CAP1RE        0x00000008
#define T_CCR_CAP1FE        0x00000010
#define T_CCR_CAP1I         0x00000020
#define T_CCR_CAP2RE        0x00000040
#define T_CCR_CAP2FE        0x00000080
#define T_CCR_CAP2I         0x00000100
#define T_CCR_CAP3RE        0x00000200
#define T_CCR_CAP3FE        0x00000400
#define T_CCR_CAP3I         0x00000800

#define T_EMR_EM0           0x00000001
#define T_EMR_EM1           0x00000002
#define T_EMR_EM2           0x00000004
#define T_EMR_EM3           0x00000008
#define T_EMR_EMC0_NONE     0x00000000
#define T_EMR_EMC0_CLEAR    0x00000010
#define T_EMR_EMC0_SET      0x00000020
#define T_EMR_EMC0_TOGGLE   0x00000030
#define T_EMR_EMC0_MASK     0x00000030
#define T_EMR_EMC1_NONE     0x00000000
#define T_EMR_EMC1_CLEAR    0x00000040
#define T_EMR_EMC1_SET      0x00000080
#define T_EMR_EMC1_TOGGLE   0x000000C0
#define T_EMR_EMC1_MASK     0x000000C0
#define T_EMR_EMC2_NONE     0x00000000
#define T_EMR_EMC2_CLEAR    0x00000100
#define T_EMR_EMC2_SET      0x00000200
#define T_EMR_EMC2_TOGGLE   0x00000300
#define T_EMR_EMC2_MASK     0x00000300
#define T_EMR_EMC3_NONE     0x00000000
#define T_EMR_EMC3_CLEAR    0x00000400
#define T_EMR_EMC3_SET      0x00000800
#define T_EMR_EMC3_TOGGLE   0x00000C00
#define T_EMR_EMC3_MASK     0x00000C00

/* Pulse Width Modulator (PWM1) */
#define PWM1_BASE_ADDR		0x40018000
#define PWM1IR          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x00))
#define PWM1TCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x04))
#define PWM1TC          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x08))
#define PWM1PR          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x0C))
#define PWM1PC          (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x10))
#define PWM1MCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x14))
#define PWM1MR0         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x18))
#define PWM1MR1         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x1C))
#define PWM1MR2         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x20))
#define PWM1MR3         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x24))
#define PWM1CCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x28))
#define PWM1CR0         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x2C))
#define PWM1CR1         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x30))
#define PWM1CR2         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x34))
#define PWM1CR3         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x38))
#define PWM1EMR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x3C))
#define PWM1MR4         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x40))
#define PWM1MR5         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x44))
#define PWM1MR6         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x48))
#define PWM1PCR         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x4C))
#define PWM1LER         (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x50))
#define PWM1CTCR        (*(volatile unsigned long *)(PWM1_BASE_ADDR + 0x70))

/* Universal Asynchronous Receiver Transmitter 0 (UART0) */
#define UART0_BASE_ADDR		0x4000C000
#define U0RBR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define U0THR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define U0DLL          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x00))
#define U0DLM          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define U0IER          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x04))
#define U0IIR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define U0FCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x08))
#define U0LCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x0C))
#define U0LSR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x14))
#define U0SCR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x1C))
#define U0ACR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x20))
#define U0ICR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x24))
#define U0FDR          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x28))
#define U0TER          (*(volatile unsigned long *)(UART0_BASE_ADDR + 0x30))

#define UART0_RBR       U0RBR
#define UART0_THR       U0THR
#define UART0_IER       U0IER
#define UART0_IIR       U0IIR
#define UART0_FCR       U0FCR
#define UART0_LCR       U0LCR
#define UART0_LSR       U0LSR
#define UART0_SCR       U0SCR
#define UART0_ACR       U0ACR
#define UART0_FDR       U0FDR
#define UART0_TER       U0TER
#define UART0_DLL       U0DLL
#define UART0_DLM       U0DLM

/* Universal Asynchronous Receiver Transmitter 1 (UART1) */
#define UART1_BASE_ADDR		0x40010000
#define U1RBR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define U1THR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define U1DLL          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x00))
#define U1DLM          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define U1IER          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x04))
#define U1IIR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define U1FCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x08))
#define U1LCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x0C))
#define U1MCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x10))
#define U1LSR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x14))
#define U1MSR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x18))
#define U1SCR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x1C))
#define U1ACR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x20))
#define U1FDR          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x28))
#define U1TER          (*(volatile unsigned long *)(UART1_BASE_ADDR + 0x30))

